/**
 * @jsx React.DOM
 */


var CategoryMenu = React.createClass({
  componentDidUpdate: function(){
    $('.dropdown-toggle').dropdown();
    console.log("[info] Cat menu");
  },
  getInitialState: function(){
    return {categories: []}
  },
  render: function(){
    var cat_items = this.state.categories.map(function(c){
      return <li><a href="#">{c}</a></li>;
    });
    return (<div className="menu-fix">
              <a href="#" className="dropdown-toggle" data-toggle="dropdown">
                <img width="40" height="40" src="images/icons/svg/clipboard.svg" alt="Pocket" />
                <span className="menu-text"> Хочу  </span>
                <b className="caret"></b>
              </a>
              <ul className='dropdown-menu cousins'>{cat_items}</ul>
            </div>
           );
  }
});

var RCategoryMenu = React.renderComponent(
  <CategoryMenu />,
  document.getElementById('category-menu')
);

var RestItem = React.createClass({
  render: function(){
    var r = this.props.data;
    return <div className='col-md-3'>{r.title}</div>;
  }
});

var RestorantList = React.createClass({
  render: function() {
    var cat = this.props.filter.category;
    var items = this.props.data.filter(function(r){
            if (cat){
              return r.category.indexOf(cat);
            } else {
              return true;
            }
          }).map(function(r){
            return <RestItem data={r}/>;
          });
    return (<div> {items} </div>);
  }
});


var RestorantsBox = React.createClass({
  componentDidUpdate: function(){
    RCategoryMenu.setState({categories: [
  "Кавказский пир",
  "Пиратский пир",
  "Охотничий пир",
  "Шашлык",
  "Морепродукты",
  "Салаты",
  "Соусы",
  "Приготовьте Сами!",
  "Шашлыки",
  "Пицца",
  "Крылышки",
  "Напитки",
  "Пироги с мясом, сыром",
  "Пироги постные",
  "Пиццы с мясом",
  "Пиццы из морепродуктов",
  "Пиццы грибные",
  "Пиццы вегетарианские",
  "Пиццы сырные и сладкие",
  "Сандвичи",
  "Пицца  \"Сделай  сам\"",
  "Кальцоне",
  "Блины",
  "Альфорно",
  "Первые блюда",
  "Паста",
  "Десерты",
  "Чизкейки",
  "Мини чизкейки",
  "Подарочные сертификаты",
  "Наборы шашлыка",
  "Основные блюда",
  "Закуски",
  "Овощи маринованные",
  "Овощи запеченные",
  "Хлеб",
  "Люля-кебаб",
  "Хлеб, выпечка, сладости",
  "Маринованное мясо",
  "Соус",
  "Пицца с двойной начинкой",
  "Буррито и Энчилада",
  "Горячие блюда",
  "Пироги",
  "Пирожки",
  "Пирожные",
  "Торты",
  "Фирменные",
  "Филадельфия",
  "Калифорния",
  "Драконы",
  "Маки",
  "Суши",
  "Сашими",
  "Темаки",
  "Супы",
  "Пиццы",
  "Суши меню",
  "Фри меню",
  "Рис",
  "Гриль-меню",
  "Закуски и пицца",
  "Постное меню",
  "Мясо",
  "Рыба",
  "Нями-Бокс",
  "Салат-Бокс",
  "Гарниры",
  "Курица",
  "Свинина",
  "Говядина",
  "Пельмени",
  "Утка",
  "Соки фреш",
  "Чай",
  "Осенние новинки",
  "Бизнес-ланчи",
  "Птица",
  "Блюда из морепродуктов",
  "Овощные блюда",
  "Роллы",
  "Гунканы",
  "Нигири",
  "Ассорти",
  "Горячее",
  "Пицца мясная",
  "Пицца вегетарианская",
  "Пицца морская",
  "Пицца сырная",
  "Суши, сашими",
  "Роллы маки",
  "Суши наборы",
  "Гарниры, супы",
  "Тайбокс",
  "Спринг роллы",
  "Фри",
  "Пицца маленькая",
  "Пицца большая",
  "Хлеб и соль",
  "Мясо, яйца и деликатесы",
  "Молочные  продукты",
  "Соевые продукты",
  "Орехи и семена",
  "Овощи, фрукты и ягоды",
  "Суперфуды",
  "Растительные масла",
  "Крупы, зерно и хлопья",
  "Полезные сладости",
  "Здоровые напитки",
  "диетические продукты",
  "Бытовая НЕ химия",
  "Борщ и уха",
  "Вареники и пельмени",
  "Пирожки и пышки",
  "Сладкое",
  "Горячие закуски",
  "Блюда из свинины",
  "Горячие блюда из курицы, птицы и кролика",
  "Горячие блюда из телятины и баранины",
  "Горячие блюда из рыбы",
  "Шашлык, котлеты, колбаски",
  "Детское меню",
  "Наборы",
  "Добавки к пицце",
  "Закуски и салаты",
  "Суши-наборы",
  "Пироги, десерты",
  "Соки, воды",
  "Пиво",
  "Алкогольные напитки",
  "Осетинские пироги",
  "Сладкие Осетинские пироги",
  "Соусы к пирогам",
  "Суши Феликс",
  "Спайс суши",
  "Спайс роллы",
  "Теплые роллы",
  "Шеф-роллы",
  "Ассорти (наборы)",
  "Light Меню",
  "ХОТ Суши",
  "Нигири суши",
  "Калифорнийские роллы",
  "Специальные роллы",
  "Сэндвичи",
  "Вегетарианское меню",
  "Бар",
  "Лапша",
  "Панини",
  "Другие блюда",
  "Детское",
  "Вегетарианцам",
  "Маки роллы",
  "Снеки",
  "Пицца острая",
  "Пицца сладкая",
  "Большая порция",
  "Фирменная пицца",
  "Ланчи",
  "Тако",
  "Буррито",
  "Кесадилья",
  "Барритос",
  "Рэлленос",
  "Начос",
  "Безалкогольные напитки",
  "Боксы",
  "Вегетарианское",
  "Диетическое",
  "Асорти-сеты",
  "Новинки от шефа",
  "Пицца 30см",
  "Пицца 40см",
  "Итальянская пицца",
  "Калифорния и филадельфия",
  "Роллы от шефа",
  "Гриль меню",
  "Готовые обеды",
  "Телятина",
  "Овощи",
  "Соевый сыр",
  "Лапша и рис в коробочках",
  "Піца",
  "Сандвічі",
  "Салати",
  "Напої",
  "Закуски/гриль меню",
  "Молочные  продукты (ТМ «АМА»)",
  "Мясо птицы ((на заказ фермы во Львовской и Киевской областях)",
  "Лапша Гречневая",
  "Лапша Рисовая",
  "Лапша Удон",
  "Лапша Яичная",
  "Диета",
  "Домашня випічка",
  "Спайс-суши",
  "Спайс-роллы",
  "Бургеры",
  "Сорбеты",
  "Хамон",
  "Сыр",
  "Оливковое масло",
  "Деликатесы",
  "Кофе",
  "Сладости",
  "Дополнительно",
  "Суши, сашими, салаты",
  "Основные",
  "Десерты и напитки",
  "Лапша Прозрачная",
  "Рисовая Лапша",
  "Удоны",
  "Алкоголь",
  "\"Собери сам\"",
  "Фри-меню",
  "Талларинес"
    ]});
  },
  getInitialState: function() {
   $.ajax({
      url: '/restaurant',
      dataType: 'json',
      mimeType: 'textPlain',
      success: function(data) {
        console.log("[info]", data[0]);
        var keys = {};
        var categories = []
        data.map(function(r){keys[r.category]=0;});
        for (k in keys){
          categories.push(k);
        }
        console.log("[info] categories", categories);

        
        this.setState({
          visible: true,
          data: data
        });
      }.bind(this)
    });
    return {
      data: [],
      filter: {category: undefined},
      visible: false
    };
  },
  render: function() {
    if (this.state.visible && this.state.filter.category) {
      return (
            <div className="List">
              <RestorantList data={this.state.data} filter={this.state.filter}/>
            </div>
        );
    }
    return <div />
  }
});

React.renderComponent(
  <RestorantsBox />,
  document.getElementById('resorantsbox')
);
